{
    "version": "2.3.1",
    "timestamp": "2024-03-26",
    
    "details": [
        { 
            "version": "2.3.1", 
            "description": [
                "Update Opinion-Documenter auf 1.0.52 - Abkürzungsverzeichnis überarbeitet."
            ]
        },
        { 
            "version": "2.3.0", 
            "description": [
                "Bugfix: Fehlermeldung 'Es ist ein internen Fehler aufgetreten. Internal server error [500]' kam regelmäßig beim Speichern, allerdings nur im Produktivsystem - diese Fehlermeldung wird nicht mehr angezeigt",
                "Bugfix: Behoben: Löschen auf oberster Ebene (mit Unterpunkten) konnte nicht wiederhergestellt werden. Sämtliche Unterelemente wurden bisher nicht wiederhergestellt",
                "Bugfix: Punkte auf oberster Ebene erhalten keine Kapitelnummer, im PDF aber schon => Bei Elementen auf erster Ebene erfolgt Infotext",
                "Feature: Über Variable besteht jetzt die Möglichkeit, das Wort 'Teilnehmer' umzubenennen auf PDF Seite 2",
                "Feature Admin: Ein Infobanner zu einem Wartungsfenster kann jetzt eingeblendet werden",
                "Update Opinion-Documenter auf 1.0.51 - Bugfix/Verbesserung: Leere Variablen werden jetzt nicht mehr als 'undefined' dargestellt im PDF, sondern als Leerzeichen. Feature: Wort 'Teilnehmer' auf PDF Seite 2 kann jetzt umbenannt werden über Variable."
            ]
        },
        { 
            "version": "2.2.0", 
            "description": [
                "Update Opinion-Documenter auf 1.0.50 - Abkürzungsverzeichnis angepasst und auf Seite 1 'der' entfernt vor dem Firmennamen",
                "Die Rechte zur Durchführung der Rechtschreibprüfung (spellcheck) werden jetzt nicht mehr durch Teilen mit expliziter Rolle überschrieben"
            ]
        },
        { 
            "version": "2.1.0", 
            "description": [
                "Nur Admin darf neue User ins System hinzufügen",
                "Update Opinion-Documenter auf 1.0.49 - 1. Spalte in Tabellen auf feste Größe eingestellt, damit u. a. in Kapitel 'Gesichtete Unterlagen' Tabelle bei längeren Texten richtig dargestellt wird.",
                "Kontaktpersonen sind jetzt in Info Dialog enthalten"
            ]
        },
        { 
            "version": "2.0.1", 
            "description": [
                "Fehlerbehebung nach Meteor Update Umstellungen: Bei Neuerstellung von Gutachten ist Vorlagenauswahl wieder möglich",
                "PDF Schutz entfernt"
            ]
        },
        { 
            "version": "2.0.0", 
            "description": [
                "Umstellung des Projekts auf Meteor Version 2.14 (von 2.7.1)"
            ]
        },{ 
            "version": "1.5.0", 
            "description": [
                "Erstellung von geschützten PDF Dateien ermöglicht"
            ]
        },
        { 
            "version": "1.4.4", 
            "description": [
                "Update Opinion-Documenter auf 1.0.47 - 1. Spalte in Tabelle des Bildcontainers etwas verbreitert. Ist der Text \"[noHeader]\" irgendwo im Untertext des Bildcontainers enthalten, wird die Überschrift der Tabelle in der Ausgabe nicht angezeigt"
            ]
        },
        { 
            "version": "1.4.3", 
            "description": [
                "Optimierungen durchgeführt. Folgende Warnung erscheint jetzt nicht mehr beim Teilen eines Gutachtens mit einem Benutzer, und zwar sowohl bei bestehenden Benutzern als auch bei neuen Benutzern: 'Can't perform a React state update on an unmounted component. (...)'",
                "Sortierreihenfolge der Spellcheck Liste angepasst"
            ]
        },
        { 
            "version": "1.4.2", 
            "description": [
                "Nicht aktive Benutzer können sich nicht mehr einloggen.",
                "Kleinere Anpassungen",
                "Fehler behhoben in App.jsx"
            ]
        },
        { 
            "version": "1.4.1", 
            "description": [
                "Menüpunkt zur Administration hinzugefügt, im 1. Schritt nur zur Ansicht der Benutzer",
                "Kleinere Anpassungen"
            ]
        },
        { 
            "version": "1.4.0", 
            "description": [
                "Das Hochladen von Bildern im Bildcontainer funktioniert jetzt ohne Fehlermeldung",
                "Die Dateinamen hochgeladener Bilder im Bildcontainer sind jetzt nicht mehr änderbar",
                "Jetzt wird das richtige Copyright (MEBEDO oder ENSMANN) gesetzt in Bildern in Abhängigkeit des ausgewählten Ausgabeformats. Vorher war es immer fest MEBEDO."
            ]
        },
        { 
            "version": "1.3.1", 
            "description": [
                "Maximale Bildbreite limitiert für Bilder im Bildtext im Bildcontainer, damit DIN A4 Format beibehalten wird"
            ]
        },
        { 
            "version": "1.3", 
            "description": [
                "Package Updates und Refactoring"
            ]
        },
        { 
            "version": "1.2.2", 
            "description": [
                "Breite der PDF-Vorschau jetzt dynamisch in Abhängigkeit des Browserfensters und kleinere Anpassungen (insbesondere Package Updates)"
            ]
        },
        { 
            "version": "1.2.1", 
            "description": [
                "Filterfunktion in Gutachtenliste hinzugefügt und kleinere Anpassungen"
            ]
        },
        { 
            "version": "1.2.0", 
            "description": [
                "Sortierungsmöglichkeit für Bilder eingefügt"
            ]
        },
        { 
            "version": "1.1.1", 
            "description": [
                "Update Opinion-Documenter auf 1.0.46 - In ENSMANN CSS Datei Farbe des Hintergrunds von Bestimmungen geändert von orange in ENSMANN rot (#CB0E25)",
                "Tooltips eingefügt für einige Buttons/Icons",
                "Kleinere Rechtschreibkorrekturen durchgeführt"
            ]
        },
        { 
            "version": "1.1.00", 
            "description": [
                "Für PDFs Archivbereich hinzugefügt und neue Funktionen Archivieren bzw. Zurücknahme der Archivierung implementiert",
                "Löschen von PDFs ist jetzt möglich",
                "Löschen (= nicht mehr teilen mit diesem Benutzer) von Gutachten ist jetzt möglich",
                "Bei Programmstart einmaliges Archivieren und Dearchivieren der PDFs implementiert, um diese im richtigen Unterverzeichnis anzulegen",
                "Status Feld für Gutachten implementiert. Status kann manuell gesetzt werden",
                "Fortschrittsanzeige in der Gutachtenliste auf Basis des Status"
            ]
        },
        { 
            "version": "1.0.29", 
            "description": [
                "User collection enthält zusätzliches Feld 'active'. Nur aktivierte Benutzer werden in Auswahllisten (Teilen oder Gutachter) gefunden",
                "E-Mail Texte bzgl. Benutzer Neuanlage und 'Passwort vergessen' angepasst: RSTH als Ansprechpartner rausgenommen",
                "Kleinere Korrekturen durchgeführt"
            ]
        },
        { 
            "version": "1.0.28", 
            "description": [
                "Opinion Option disableCopyright ist jetzt initial mit Wert (false) belegt",
                "Neue Opinion Option hasAbbreviationsPage, um Abkürzungsverzeichnis ein-(default) bzw. auszublenden",
                "Update Opinion-Documenter auf 1.0.45 - Zeilenabstände im Inhaltsverzeichnis minimal vergrößert (für MEBEDO und ENSMANN). Anpassungen bzgl. Seitenumbruch, wenn kein Abkürzungsverzeichnis enthalten sein soll"
            ]
        },
        { 
            "version": "1.0.27", 
            "description": [
                "Fix #75: PDF-Vorschau optimiert",
                "Fix #77: Breite von Bildern in der Handlungsempfehlung begrenzt",
                "enhancement #80: Antworten: Bei Klick auf Haken wird zunächst gespeichert",
                "enhancement #81: Im Benutzerprofil Text 'Foo bar' unter dem Bild entfernt",
                "enhancement #82: Rückmeldung bei Speicherung Benutzerprofil",
                "Update Opinion-Documenter auf 1.0.44 - Bugfix in Tabelle der 'Gesichteten Dokumente' mit Spaltenbreite"
            ]
        },
        { 
            "version": "1.0.26", 
            "description": [
                "Bugfix: Durch Meteor/Mongo Update konnten keine neuen Gutachten angelegt werden",
                "Fix #72: Anzeige Gutachter in Bearbeitung/Eingabe und Ausgabe angeglichen"
            ]
        },
        { 
            "version": "1.0.25", 
            "description": [
                "Neue Eigenschaft beim Gutachten zur Steuerung des Ausgabeformats um unterschiedliche Gutachtenformate zu produzieren.",
                "Bugfix #78 beim Speichern, Bearbeiten eines Bildes TypeError: Cannot read properties of undefined (reading 'link')",
                "Update meteor to 2.7.1",
                "Update Opinion-Documenter auf 1.0.43 - Möglichkeit der Erstellung von ENSMANN Assessments/Gutachten. Fix #79: Ausgabe ist angepasst, wenn Zeitraum des Gutachtens 1 Tag ist"
            ]
        },
        { 
            "version": "1.0.24", 
            "description": [
                "Layout Änderung Inhaltsverzeichnis",
                "Update Opinion-Documenter auf 1.0.42 - Schwarze Schrift ohne Unterstrich im Inhaltsverzeichnis"
            ]
        },
        { 
            "version": "1.0.23", 
            "description": [
                "Bugfix PDF-Live-Preview",
                "Update Opinion-Documenter auf 1.0.41 - Layout Anpassungen bzgl. Antworten und Handlungsempfehlungen: border-bottom and padding-bottom"
            ]
        },
        { 
            "version": "1.0.22", 
            "description": [
                "Neues Feature: PDF-Live-Preview - eine automatisch aktualisierende Direkt-PDF-Ansicht",
                "Neues Feature: E-Mail-Benachrichtigungen, wenn Dokumente geteilt, ein Post mit Erwähnung des Users, ein Antwort auf eine Aktivität erstellt wird",
                "Update Opinion-Documenter auf 1.0.39 - Farbänderung orangeton für dringender handlungsbedarf",
                "Update meteor auf 2.5.1"
            ]
        },
        { 
            "version": "1.0.21", 
            "description": [
                "Update opinion-documenter auf 1.0.38 Page-break Optimierung (schnellere PDF Erstellung) und Layout Anpassungen in Aufstellung der Maßnahmen",
                "Timeout bei temporärer PDF Erstellung (Vorschau) verkürzt von 5 auf 1 Minute"
            ]
        },
        { 
            "version": "1.0.20", 
            "description": [
                "Update opinion-documenter auf 1.0.37 Page-break bug",
                "update meteor auf 2.5.0"
            ]
        },
        { 
            "version": "1.0.19", 
            "description": [
                "neue Funktion ShareWithExplicitRole und löschen von Benutzern zu einem Dokument",
                "BugFix #70 Anzeigeprobleme PDF-Vorschau"
            ]
        },
        { 
            "version": "1.0.18", 
            "description": "Korrektur (server/datamigration) implementiert für noch aus der Vergangenheit enthaltene opinionDetails mit Text im printTitle."
        },
        { 
            "version": "1.0.17", 
            "description": "Beschreibung der Versionierung umgekehrt. Mentioned-Suche case-insensitive."
        },
        { 
            "version": "1.0.16", 
            "description": "Fehlerbereinigung beim Posten einer Nachricht auf oberster Ebene der Opinion. Filtern der Benutzernamen @xxxx (Mentioned) #67."
        },
        { 
            "version": "1.0.15", 
            "description": "Spellcheck-Funktionaltät implementiert."
        },
        { 
            "version": "1.0.14", 
            "description": "'Passwort vergessen' Funktion implementiert, Option Fotografiererlaubnis implementiert"
        },
        { 
            "version": "1.0.13", 
            "description": "Links zur Startseite implementiert in Menüs der Dialoge und in MEBEDO Logo"
        },
        { 
            "version": "1.0.12", 
            "description": "Fehlerbehebung bzgl. Darstellung von Bildmarkierungen. Willkommenstext eingefügt auf Startseite. Aktualisierung des Package markerjs2 (2.4.1 => 2.13)."
        },
        { 
            "version": "1.0.11", 
            "description": "Aktualisierung des Package opinion-documenter (Version 1.0.35) mit Layoutanpassungen: Schriftgröße 11 auch für Fragen."
        },
        { 
            "version": "1.0.10", 
            "description": "Aktualisierung des Package opinion-documenter (Version 1.0.34) mit Layoutanpassungen."
        },
        { 
            "version": "1.0.9", 
            "description": "Layoutanpassungen Umbruch bei zu langen Texten und Maximalbreite für Bilder. Aktualisierung des Package opinion-documenter (Version 1.0.33) mit einigen Layoutanpassungen und neuen internen Variablen."
        },
        { 
            "version": "1.0.8", 
            "description": "Performanceverbesserung für Details. Aktualisierung des Package opinion-documenter (Version 1.0.32) mit einigen Layoutanpassungen."
        },
        { 
            "version": "1.0.7", 
            "description": "Aktualisierung des opinion-documenter mit einigen Layoutanassungen, Erhöhung der Bildqualität von 60 auf 75%, Picturecontainer ist nun Bestandteil des Inhaltsverzeichnis."
        },
        { 
            "version": "1.0.6", 
            "description": "In Actiontext des Maßnahmentexts im Default <p></p> eingefügt."
        },
        { 
            "version": "1.0.5", 
            "description": "Bugfix #48 - Sortierung der Elemente innerhalb der Aufstellung Maßnahmen nun numerisch, nicht mehr alphanumerisch (Text). Sowie diverse kleinere textliche Anpassungen."
        },
        { 
            "version": "1.0.4", 
            "description": "Bugfix #47 - Der Wert der aktuellen Bearbeitung eines Bausteins geht nicht mehr verloren, wenn ein anderer Benutzer z. B. Variablen aktualisiert." 
        },
        { 
            "version": "1.0.3", 
            "description": "Prüfen von untergeordneten Bausteinen, ob das Elternelement bereits gelöscht wurde. Ist dem so, so wir das betroffene Element ebenfalls als gelöscht markiert." 
        }
    ]
}
